[
   
{"title":"Audi Q4 e-tron and Q4 Sportback e-tron (Expected: 2021)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/medium-8476-2022audiq4sportbacke-troneuropeanmodelshown-1619457023.jpg?crop=1xw:1xh;center,top&resize=480:*","description":"As you might expect from its name, the Q4 e-tron and its sharp-looking Sportback version will slot in between Audi's Q3 and Q5 crossovers in size. In the middle of this Audi sandwich is an all-electric compact SUV. Like many of the Volkswagen Group's upcoming EV models, it will ride on the company's MEB platform. The Q4 e-trons fit in a segment with the Tesla Model Y and Volvo XC40 Recharge. Base models will get a 201-hp electric motor and a 77.0-kWh battery pack and should start around $45,000. An all-wheel-drive model will also be offered with 295 horsepower and a range of up to 250 miles. Both Q4 e-tron models will support charging speeds of up to 125 kW. Audi told us they'll start selling dual-motor models first as soon as fall 2021. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g36110855/2022-audi-q4-e-tron-revealed-gallery/"},

{"title":"BMW i4 (Expected: Late 2021)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2022-bmw-i4-m50i-108-1622gg-1627497196.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"BMW's first \"i\" cars, the i3 and i8, relied upon wild, futuristic designs to make a statement. The next model in the electric sub-brand has far more conventional styling, as it's intended to be similar to the 4-series Gran Coupe four-door hatchback. The i4 comes standard in rear-wheel drive with a 335-hp electric motor and an 81.5-kWh battery pack. The EPA estimates range around 300-mile mark, and BMW says it can get to 60 mph in 5.7 seconds. That version starts at $56,395. An M-badged model, dubbed the M50 starts at $66,895 with all-wheel drive and an additional electric motor for a combined 536 horsepower. It should go on sale sometime in 2021. —Joey Capparella","viewCar":"https://www.caranddriver.com/photos/g36597635/2022-bmw-i4-us-specs-price-gallery/"},

{"title":"BMW iX (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2022-bmw-ix-104-16future-1615998559.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"The iX is slated to go on sale by early 2022. Of course, Europe will get it before we do. It's intended as a flagship for BMW's expanded \"i\" family of electrified vehicles. BMW's goals for the iX sound promising: an SUV with a combined output of 516 horsepower with 300 miles of range. BMW also said that it will support DC fast charging up to 200 kW. The iX is roughly the same size as the current X5 and starts at $84,194 with standard all-wheel drive. A sportier iX M60 model is on the way, but expect its extra horsepower and chassis upgrades to add a big bump to that entry fee. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g34641597/2022-bmw-ix-revealed-gallery/"},

{"title":"Bollinger B1 (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bollinger-b1-201-161015-1615999247.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"From a Michigan-based startup comes a pair of utilitarian-looking high-end vehicles, including this B1 SUV, each priced at $125,000 and expected to start reaching customers in 2021. They're targeted at people who are prepared to add a lot of options at extra cost to what's already a high-end SUV or truck. Both SUV and truck are claimed to offer 614 horsepower, 668 pound-feet of torque, and a 4.5-second zero-to-6o-mph time. The Bollinger B1's 120.0-kWh battery pack is said to offer up to 200 miles of range. Other specs include a 5000-pound payload capacity and 15 inches of ground clearance. —Laura Sky Brown","viewCar":"https://www.caranddriver.com/news/a34946386/bollinger-b1-b2-production-renderings/"},

{"title":"Bollinger B2 (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/bollinger-b2-204-1601015-1615999249.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"The Bollinger B2 pickup has foldable and removable body panels, Jeep Gladiator style, plus locking differentials, disconnecting sway bars front and rear, and up to 20 inches of ground clearance to seal its off-road cred. From there it gets interesting: The B2 will feature both front and rear tailgates, geared axle hubs, a hydropneumatic suspension, and the ability to carry 16-foot pieces of lumber with the tailgate closed. The B2 will cost $125,000, with Bollinger currently taking deposits for an expected 2022 on-sale date. —Laura Sky Brown","viewCar":"https://www.caranddriver.com/news/a34946386/bollinger-b1-b2-production-renderings/"},

{"title":"Byton M-Byte Concept (Expected: Mid-2021)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/1-byton-concept-exterior-1547052598.jpg?crop=1.00xw:0.891xh;0,0.00680xh&resize=480:*","description":"Byton's M-Byte and K-Byte concepts, a crossover and a sedan, were first seen at the CES technology show last January. They're the leading edge of what's expected to be a flood of electric vehicles from the Chinese startup, which has only been around since 2016. European countries will get to buy them first, but we expect the M-Byte to start at $45,000 in the U.S. The 272-hp rear-wheel-drive model has a 72.0-kWh battery, as well as two versions with a larger, 95.0-kWh pack: a 408-hp all-wheel drive version and a rear-wheel drive model. Byton says the smaller battery pack can provide up to 224 miles of range, and the larger 95-kWh battery is good for up to 286 miles. —Joey Capparella ","viewCar":"https://www.caranddriver.com/news/g25808603/byton-electric-car-suv-2020/"},

{"title":"Cadillac Lyriq (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2023-cadillac-lyriq-102-everev-1610469354.jpg?crop=1xw:1xh;center,top&resize=480:*","description":"The first electric Cadillac is almost here. It will be built in Spring Hill, Tennessee, alongside other future GM electric vehicles. The Lyriq will be sold in both single-motor rear-wheel-drive and dual-motor all-wheel-drive versions. Cadillac says it will have a range of more than 300 miles on a single charge, using GM's modular platform and Ultium scalable battery architecture. Although details are still hush-hush, Cadillac says the Lyriq will likely offer a battery with about 100-kWh worth of capacity, with DC fast charging standard. Photos of the Lyriq's giant 33.0-inch curved LED display have been shared, and Cadillac recently partnered with a digital design company that's worked on video games and movies for the display's look and feel. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g33535670/2023-cadillac-lyriq-revealed-gallery/"},

{"title":"Cadillac Celestiq (Expected: Sometime before 2025)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/cadillac-celestiq-ev-every-1610473336.png?crop=1xw:1xh;center,top&resize=480:*","description":"The Cadillac Celestiq, like every upcoming GM EV, will be built on the Ultium battery platform. The Celestiq will likely have a driving range of 300 miles or more. Dual-motor all-wheel drive is also available, and it will also have four-wheel steering, likely the same system as already showcased on the GMC Hummer EV. It also features a four-panel \"smart glass\" roof that can change its level of transparency over each passenger. This will likely be Cadillac's EV flagship, starting around $100,000. More details coming soon. —Austin Irwin","viewCar":"https://www.caranddriver.com/news/a35182022/cadillac-celestiq-previewed/"},

{"title":"Canoo Pickup Truck (Expected: 2024)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/canoo-truck-161fut38-1616000264.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"Canoo is an electric automotive startup from California, and this is its pickup. For now, it is called Pickup Truck. The Canoo pickup promises 600 horsepower and 200 miles of range. It's smaller than what's typically found in the mid-size pickup segment, being two feet shorter than the Ford Ranger. Canoo says its pickup will be offered with a six- to eight-foot pickup bed and that it will be available for preorder mid-2021, with production starting in 2023. —Austin Irwin","viewCar":"https://www.caranddriver.com/news/a35812872/canoo-electric-pickup-truck-revealed/"},

{"title":"Canoo Van (Expected: Late 2021)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/canoodesignext-156future-1616001062.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"Like Canoo's pickup, this seven-seat EV is built on a skateboard platform, similar to what BMW, Mercedes-Benz, and Volkswagen use to easily swap bodystyles on similar underpinnings. Canoo is testing a subscription service that would allow consumers to use and pay for the EV only when it's needed. Canoo claims this little bus will have a range of 250 miles and 300 horsepower. Details on subscription cost or initial cost haven't been revealed yet, but expect more information as we get closer to 2022. —Austin Irwin","viewCar":"https://www.caranddriver.com/news/a29278222/canoo-ev-subscription/"},

{"title":"Chevrolet Silverado Electric (Expected: 2023)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2020-chevrolet-silverado-midnight-edition-111-1598914555.jpg?crop=1xw:1xh;center,top&resize=480:*","description":"Turns out the GMC Hummer EV and SUV were a little taste of what we'll see from Chevy's upcoming all-electric Silverado. They'll be built under the same roof, with the Silverado also using GM's Ultium battery pack and offering up to 400 miles on a single charge. Chevy told us earlier that it plans to offer its Silverado EV from work truck trim up to a fully loaded pickup. Chevy hasn't made clear when production will start, but if it wishes to deliver on its promise of 30 new EVs by 2025, we think the battery-powered Silverado will be here soon enough. —Austin Irwin","viewCar":"https://www.caranddriver.com/news/a31227446/chevy-electric-pickup-confirmed-2025/"},

{"title":"Faraday Future FF91 (Expected: 2023)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/faraday-future-ff-91-104-1598646951.jpg?crop=1xw:1xh;center,top&resize=480:*","description":"The Faraday Future FF91 once looked like it was going to make waves, but will it ever reach production? We first saw the FF91 at CES 2017, and the startup then said the car was production-ready. It boasts a claimed 1050 horsepower from two rear-mounted electric motors, plus an available front-mounted motor. Faraday Future claims the big crossover can blast from zero­ to 60 mph in 2.4 seconds. A 130.0-kWh battery pack created in partnership with LG Chem is said to provide an estimated 378-mile range. On-sale date is TBA. —Connor Hoffman","viewCar":"https://www.caranddriver.com/photos/g15238737/meet-the-faraday-future-ff91-the-most-advanced-ev-ever-if-it-reaches-production-official-photos-and-info-gallery/"},

{"title":"Fisker Ocean (Expected: Late 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/6-fisker-ocean-front-3-4-close-f6rvmv-1627gg-1627497410.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"A stylish 300-mile-range electric SUV with a solar roof sounds promising, and Henrik Fisker's EV startup hopes to keep that promise with the Fisker Ocean. Slated for its big reveal at the Los Angeles Auto Show in November, Fisker says Ocean production should begin in the fourth quarter of 2022. The company says it has 17,300 paid reservations to fill, as well as orders from global fleet companies like Onto, Viggo, and Credit Agricole Consumer Finance. —Austin Irwin","viewCar":"https://www.caranddriver.com/news/a34143249/fisker-ocean-electric-crossover-details/"},

{"title":"Ford Explorer EV (Expected: 2023)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/frdnsuvp0059d-explorer-headlightson-dusk-hybrid-01a-rgb-social-1627664068.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"Last year Ford sold over 226,000 Explorers in the U.S., so giving it the fully electric treatment is an obvious move. Ford announced in May 2021 its popular three-row SUV would be joining the Mustang Mach-E and the E-Transit electric van in Ford's growing electric lineup. Though the current Explorer offers a 318-hp hybrid V-6 powertrain, we suspect that, like with the Mach-E and F-150 Lightning, there will be a rear- and all-wheel-drive Explorer EV. —Austin Irwin","viewCar":"https://www.caranddriver.com/news/a36544614/ford-explorer-electric-coming-soon/"},

{"title":"Ford F-150 Lightning (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2022-ford-f-150-lightning-202-162gggg-1627915672.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"The bestselling vehicle in the U.S. for nearly 40 years straight, the Ford F-series pickup has gone electric. Two battery packs are available, with an EPA-estimated goal of 230 miles for rear-drive trucks and 300 miles for dual-motor all-wheel-drive models. Both configurations will have 775 pound-feet of torque; that's 205 more than the PowerBoost hybrid V-6. Ford claims its 563-hp dual-motor truck can get to 60 mph in the mid-4.0 second range. We'll find out later this year when we test an F-150 Lightning if it's one of the quickest pickups we've ever tested. The F-150 Lightning will be built at Ford's new Rogue Electric Vehicle Center in Dearborn, Michigan, and should be on sale sometime spring 2022. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g36477338/2022-ford-f-150-lightning-specs-revealed-gallery/"},

{"title":"Genesis Essentia (Expected: 2023)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/genesis-essentia-concept-leadgallery-2-1598651820.jpg?crop=0.9996532078275947xw:1xh;center,top&resize=480:*","description":"Very much a concept, the Genesis Essentia is a slick luxury coupe that is possibly planned for production. Hyundai invested $90 million in Croatian carmaker Rimac, which specializes in battery-electric supercars, a year after this concept debuted. If it happens, it would be the first EV from Hyundai's luxury brand.—Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g19598448/genesis-essentia-concept-official-photos-and-info-gallery/"},

{"title":"Genesis Electrified G80 (Expected: Late 2021)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/g80-ev-6-16gg50-1619461964.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"If it weren't for the plug up its nose, it might look like any Genesis G80, but it's not. The Electrified G80 is battery and electric motors only. There aren't many details available yet, but we know it's supposed have up to 310 miles of range, fast-charging capability, and all-wheel drive standard. Hopefully it's on sale by late 2021, but it's possible we won't see it until the following year. Expect pricing to start above the $48,745 starting price of the gas-powered G80. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g36155981/genesis-electrified-g80-revealed-gallery/"},

{"title":"Dodge eMuscle (Expected: 2024)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/edodge-1627580425.gif?crop=1xw:1xh;center,top&resize=480:*","description":"Dodge is building a muscle car that replaces displacement with electricity and a bunch of quiet torque. Aside from a smoky teaser clip, there's not much information about this new model. It might be an electric version of the two-door Challenger or four-door Charger, but it could also be something completely different. The Fratzog logo shown in the teaser clip was used in the 1960s and '70s on pretty much all Dodges of that era. If they're crazy enough to put 797 horsepower in a Charger and move a 6866-pound Ram 1500 to 60 mph in just 3.7 seconds, you can bet Dodge's electric future will be an exciting one. —Austin Irwin","viewCar":"https://www.caranddriver.com/reviews/a34388822/2021-dodge-charger-srt-hellcat-redeye-by-the-numbers/"},

{"title":"GMC Hummer (Expected: 2021)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2022-gmc-hummer-ev-402-every-1610475448.jpg?crop=1xw:1xh;center,top&resize=480:*","description":"The GMC Hummer EV is expected to come as both an SUV and a pickup. It will be offered with a one-, two-, and three-motor setup, with a promised 1000 horsepower and an insane 11,500 pound-feet of torque for the three-motor. GMC announced it would have removable roof panels, four-wheel drive, and a four-wheel-steering crab walk mode. The Hummer's debut was initially delayed due to the pandemic, but GMC still plans to start deliveries of the three-motor 1000-hp First Edition model, which starts at $112,595, by the end of 2021. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g34429237/2022-gmc-hummer-ev-revealed-gallery/"},

{"title":"Jeep Wrangler Magneto EV (Expected: Early 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/jeep-wrangler-magneto-bev-concept-101-1futre-1616532404.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"Jeep is working on a battery-powered version of the iconic Wrangler off-road SUV. This Magneto Concept was revealed as part of the Easter Jeep Safari. On the surface it looks like your typical two-door Wrangler Rubicon, but on the inside the Magneto has four battery packs with a combined output of 285 horsepower. A six-speed manual is also onboard, as Jeep says the motor will regenerate power when you use the clutch to prevent rev hang and give a little back to the batteries. Don't get too excited, as this isn't the real thing yet, but expect the production model later to arrive in 2022. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g35892625/easter-jeep-safari-jeep-concepts-gallery/"},

{"title":"Kia EV6 (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2022-kia-ev6-101-161future-1616078495.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"The Kia EV6 is one of 11 new electric Kias promised by 2026. The EV6 rides on the same E-GMP architecture as the Hyundai Ioniq 5, and it will offer versions ranging between 167 and 576 horsepower with a range of up to 300 miles. Rear- and all-wheel-drive versions will be offered, with the choice of either a 58.0 or a 77.4-kWh battery pack. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g35824011/2022-kia-ev6-design-specs-gallery/"},

{"title":"Lagonda All-Terrain (Expected: 2023)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/lagondaallterrainconcept-3-1551717683.jpg?crop=1xw:1xh;center,top&resize=480:*","description":"Aston Martin has relaunched the Lagonda name as an all-electric luxury brand for the upper crust. Its wagon hull rides on the same platform as the Aston Martin DBX, which makes us wonder how close an electric DBX is from production. Aston boss Andy Palmer told us that he expects electric models to have performance similar to the brand's gasoline equivalents and that he expects more than 300 miles between visits to the plug. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g26625987/aston-martin-lagonda-all-terrain-concept-photos-info-gallery/"},

{"title":"Lexus EV SUV (Expected: 2022 or sooner)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/lexuskenshikidecember2everyevstory-1610483932.jpg?crop=1xw:1xh;center,top&resize=480:*","description":"Although Lexus is a little late to the party, the luxury brand has announced it will eventually offer an EV drivetrain called Direct 4. It showcased an SUV prototype with the technology in 2020, with front and rear electric motors that produce 201 horsepower and 221 pound-feet of torque each. Total output is unknown. Although the prototype vehicles testing Direct 4 are likely very pre-production test mules, we expect the real thing to be a compact crossover that's close to the Lexus NX in size. —Austin Irwin","viewCar":"https://www.caranddriver.com/news/a34919844/lexus-electric-suv/"},

{"title":"Lotus Evija (Expected: Late 2021)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/lotus-evija-101-1563220910.jpg?crop=1xw:0.9998183545718757xh;center,top&resize=480:*","description":"This track-ready Lotus is nearly here. Limited to just 130 units, the Evija is a hypercar with a podium of impressive EV feats. Charging speeds of as much as 800 kW are supported, though the millionaire buying one should keep in mind even today's commercially available 350-kW chargers should be plenty quick. The Evija makes 1254 pound-feet of torque with all-wheel drive and an insane 1972 horsepower. Other track-ready goodies include a pushrod-operated rear suspension and extensive aerodynamic bits that include a diffuser with a drag-reduction system and an adjustable rear wing. The price tag should be around $2.4 million, and though it won't be exactly street legal in the U.S., for a few dollars more, exceptions can be made. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g28401001/lotus-evija-gallery/"},

{"title":"Lotus (Expected: 2022—2026)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/lotus-ev-teaser-100804ggg-1631028570.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"The future of Lotus is a fully-electric lineup consisting of two new SUVs, a coupe-sedan, and a sports car. As part of what Lotus calls a Vision80 plan, the company homes to have successfully launched all these new models by its 80th birthday party in 2028. The larger SUV should be revealed as early as 2022, followed by the coupe-sedan in 2023, with a smaller SUV coming in 2024. These electric-Lotus will be built at Lotus's new plant in Wuhan. The unnamed sports car will follow in 2026, and will be built in the U.K. —Austin Irwin","viewCar":"https://www.caranddriver.com/news/a37445459/lotus-four-electric-cars-planned/"},

{"title":"Lucid Air (Expected: 2021)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/lucid-air-beauty-shot-web-1597084770.jpg?crop=1xw:0.9998883305415969xh;center,top&resize=480:*","description":"This California startup, founded in 2007 as a battery-technology company, announced it would build a Tesla-fighting electric four-door sedan in 2016, but the car's actual arrival seemed in question until recently. In 2020, though, Lucid Motors received a $1 billion investment from Saudi Arabia and in November broke ground on its future assembly plant in Casa Grande, Arizona. It has also partnered with Electrify America's network of chargers, so the promised luxury sedan looks a lot closer to reality now. Lucid promises 406 miles of range, 480 horsepower, plus over-the-air updates and autonomous-driving technology for its base model. The Air starts at $77,400. The company announced it will start production in 2021, after the factory's first stage of construction is completed. —Laura Sky Brown","viewCar":"https://www.caranddriver.com/photos/g20920455/lucid-air-to-start-at-60000-fancier-version-to-top-100k-gallery/"},

{"title":"Mazda MX-30 (Expected: Late 2021)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mazda-mx-30-concept-101-1571800374.jpg?crop=0.9998181818181818xw:1xh;center,top&resize=480:*","description":"","viewCar":"https://www.caranddriver.com/photos/g29556189/mazda-mx-30-concept-photos-info-gallery/"},

{"title":"Mercedes-Benz EQA (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/mercedes-benz-eqa-107-161future-1616003761.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"Mercedes-Benz's new EV lineup will be referred to as the EQ family. The Mercedes-Benz EQA, the company's smallest electric compact SUV, was revealed earlier this year in Europe-spec form. The Euro version of the EQA has 187 horsepower and 277 pound-feet of torque; it starts at around $57,000. Mercedes-Benz suggested an EQA in the U.S. could have all-wheel drive with around 280 horsepower. Ours would likely have a range of 250 miles. Expect to see more EQA news later this year. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g35257814/2022-mercedes-benz-eqa-revealed-gallery/"},

{"title":"Mercedes-Benz EQB (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2022-mercedes-benz-eqb-105-16gg-1619467109.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"The Mercedes-Benz EQB is nearly ready for its big debut. It's based on the GLB-class SUV and will have at least 221 horsepower with between 200 and 250 miles of range. There's also an available third row, but the EQB's size is better suited for two. Hopefully an all-wheel-drive powertrain will be available here in the U.S. We'll update this space as information is available. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g36132152/2022-mercedes-benz-eqb-revealed-gallery/"},

{"title":"Mercedes-Benz EQC (Expected: Maybe)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2020-mercedes-benz-eqc-drive-104-1558020251.jpg?crop=0.9999047573693985xw:1xh;center,top&resize=480:*","description":"The Mercedes-Benz EQC 400 4Matic, Mercedes's first electric vehicle, is a compact crossover with an estimated range of 200 miles. Mercedes-Benz announced in February that it had decided to not offer the EQC in the United States—for now. So they're saying there's a chance, right? We tested the EQC this past spring and found it hewed closely to the values Mercedes is known for: comfort, quietness, and precision in steering. It comes with two electric motors offering all-wheel drive and has a claimed 4.9-second zero-to-60-mph time. —Colin Beresford","viewCar":"https://www.caranddriver.com/photos/g27493813/2020-mercedes-benz-eqc400-drive-gallery/"},

{"title":"Mercedes-Benz EQE (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2023-mercedes-benz-eqe-6-163gg-1631026671.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"Somewhere between Tesla Model 3 and Model S in size, the Mercedes-Benz EQE sedan was revealed at the Munich auto show this year. The EQE will launch as a single motor model with 288 horsepower. Later, an all-wheel drive version with two motors and over 400 horsepower will follow. Mercedes claims a driving range of 410 miles on the optimistic European WLTP test cycle, but expect EPA-estimated range to by somewhat lower than that.—Austin Irwin","viewCar":"https://www.caranddriver.com/mercedes-benz/eqe"},

{"title":"Mercedes-Benz Vision EQXX (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/3f4c974ggg-1627498439.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"Mercedes-Benz will use the EQXX prototype to showcase the brand's EV driving range potential. Currently, the EQS sedan is the company's longest-range model with a claimed 435 miles of range (European testing cycle) from its 107.8-kWh battery. The EQXX is claimed to push that to 620 miles using Mercedes-Benz's newest energy-dense battery technology and slippery aerodynamics. Hardware on a prototype like this is a peek at what future Mercedes-Benzes will offer. More details should be available in the next few months. —Austin Irwin","viewCar":"https://www.caranddriver.com/news/a37102772/mercedes-benz-eqxx-preview/"},

{"title":"Nissan Ariya (Expected: Late 2021)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/2022-nissan-ariya-107-1594741743.jpg?crop=0.9998181818181818xw:1xh;center,top&resize=480:*","description":"The Ariya is Nissan's second fully electric vehicle and builds on what Nissan has created with the Leaf. Nissan said the most powerful version of this electric crossover has 389 horsepower, while the longest-range model promises to go 300 miles on a charge. It'll feature Nissan's new semi-autonomous driving system, ProPilot 2.0, and a dual front-/rear-motor drive configuration. The Ariya will arrive in Japan first, but the U.S. will see it sometime later in 2021 with a starting price of around $40,000. —Colin Beresford","viewCar":"https://www.caranddriver.com/photos/g33311834/2022-nissan-ariya-revealed/"},

{"title":"Toyota bZ4X Concept (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/toyota-bz4x-concept-104-16gg-1619463112.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"Toyota promised a plethora of new electric vehicles sometime before 2025, seven of which will use the bZ model name. The bZ4X name rolls off the tongue like a Wi-Fi password, but it's a peek into what Toyota's electric future will look like. It's pretty much the RAV4 EV, but Toyota hasn't hinted at range or charging speed. They did tell us it will use the e-TNGA platform created through a partnership with Subaru. The platform allows for single-motor front- or rear-wheel-drive setups or dual-motor, all-wheel-drive models. We expect pricing to start around $40,000, or at least a little more than the plug-in hybrid RAV4 Prime. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g36145522/toyota-bz4x-concept-revealed-gallery"},

{"title":"VinFast VFe (Expected: 2023)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/vf33-frontview-1-1gg87-1627921718.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"VinFast sold around 30,000 vehicles in Vietnam last year. The company has yet to make a profit but is quickly growing in Vietnam, becoming the fourth most popular car brand there this year, with an 8.3 percent share of the market. Now the fledgling company has announced plans to expand into North America and Europe, with the goal of starting sales in the United States in March 2022. The automaker's global lineup will be centered around electric crossovers. The Vietnamese brand's entry to the U.S. market will be based around the upcoming VFe35 and VFe36, a compact and mid-size electric crossover. —Caleb Miller","viewCar":"https://www.caranddriver.com/news/a37012830/vinfast-vietnam-ev-maker-expanding/"},

{"title":"Volkswagen ID.8","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/191215vw11-hh-0149-1581005487.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"No real timeline for the Volkswagen ID.8 has been revealed yet, but VW boss Herbert Diess confirmed that the brand plans to introduce a fully electric SUV that's bigger than the already available ID.4. Diess didn't exactly say it would be available in North America, but the continued demand for larger SUVs in the U.S. makes it an obvious move. It should be roughly the same size as the three-row Atlas (pictured here) and offer more range than the smaller ID.4 SUV, which has 250 miles of range and 201 horsepower. —Austin Irwin","viewCar":"https://www.caranddriver.com/news/a37081995/volkswagen-id8-confirmed/"},

{"title":"Volkswagen ID.Buzz (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/iba-8357-copy-1630gg-1631025438.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"VW's second EV, launching in 2023, will be a modern take on its first-generation Type 2 Microbus from the 1950s and 1960s. As with its revival of the Beetle in the late 1990s, VW hopes the new Microbus, or whatever its name is for production, tugs at the heartstrings of boomers everywhere. As with its other coming EVs, the Buzz will use the same MEB-platform component set, with a battery pack integrated into the floor, and will likely have room for six to eight people. The ID.Buzz above was spotted testing autonomous driving tech for Argo AI, a U.S.-based engineering firm with ties to Ford.—Dave VanderWerp","viewCar":"https://www.caranddriver.com/news/a23473534/volkswagen-electric-cars-plans/"},

{"title":"Volkswagen ID.Space Vizzion (Expected: 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/volkswagen-id-space-vizzion-concept-101-1574227476-1-1598913379.jpg?crop=0.9998181818181818xw:1xh;center,top&resize=480:*","description":"The Volkswagen I.D. Space Vizzion concept made its debut at the Los Angeles Auto Show, where it looked very production ready. It will be VW's third U.S. EV offering, coming in 2022. Although wagons are a perpetually tough sell in the U.S., VW touts its large interior and high aerodynamic efficiency, which help to boost the large wagon's range to a claimed 300 miles. —Dave VanderWerp","viewCar":"https://www.caranddriver.com/photos/g29852464/vw-id-space-vizzion-concept-ev-revealed-gallery/"},

{"title":"Volvo C40 Recharge (Expected: Early 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/volvo-c40-recharge-102-1614future-1616081500.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"Volvo already sells a 402-hp XC40 Recharge with 208 miles of range. The C40 Recharge is essentially the sportback version of that vehicle, and unlike the XC40, it is only offered as an EV. The C40 shares the same powertrain as the XC40 Recharge, with two electric motors and 75.0-kWh battery pack. It's also the same powertrain the Polestar 2 uses. Volvo estimates the C40 to have an EPA-rated driving range of 210 miles. Pricing will start at $59,845, or $4700 more than the XC40 Recharge. You can secure one with a $500 deposit today, but with C40 Recharge production beginning this fall, you should start seeing them on the roads as early as later 2021 or early next year. —Austin Irwin","viewCar":"https://www.caranddriver.com/photos/g35685598/2022-volvo-c40-recharge-revealed-gallery/"},

{"title":"Volvo XC60 (Expected: 2024)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/283271-volvo-car-group-and-northvolt-to-join-forces-in-battery-development-and-1624389871.jpg?crop=0.9205347593582888xw:1xh;center,top&resize=480:*","description":"The third generation of Volvo’s compact crossover is set to begin production in 2024 and is expected to retain the XC60 moniker. Volvo has implied that the next XC60 will be electric only, and it will be the first car to utilize battery cells developed through a joint venture with Swedish battery maker Northvolt. This technology will emerge from a research and development center in Sweden that Volvo and Northvolt plan to have operational by 2022. The partnership will also lead to a gigafactory in Europe to produce batteries starting in 2026, although the initial battery allocation for the XC60 EV will come from an existing Northvolt plant in Sweden. The new electric XC60 will be part of Volvo’s push to have EVs make up half of its sales by 2025 and transition to a fully electric lineup by 2030. —Austin Irwin","viewCar":"https://www.caranddriver.com/volvo/xc60"},

{"title":"Volvo XC90 (Expected: Late 2022)","img":"https://hips.hearstapps.com/hmg-prod.s3.amazonaws.com/images/283690-volvo-concept-recharge-1625gg-1627659389.jpeg?crop=1xw:1xh;center,top&resize=480:*","description":"The Volvo Concept Recharge (pictured here) is a glimpse of what the next XC90 that's due to arrive next year will look like. Some iteration of what's shown on the concept will likely reach every future Volvo. We suspect the next three-row SUV from Volvo will arrive either late next year or sometime in 2023. Volvo confirmed the XC90's replacement will be all-electric and given a new name. —Austin Irwin","viewCar":"https://www.caranddriver.com/news/a36889545/volvo-concept-recharge-revealed/"}
]